{
  "←": 50270,
  "↑": 50271,
  "→": 50272,
  "↓": 50273,
  "∆": 50274,
  "∇": 50265,
  "∊": 50275,
  "∘": 50276,
  "√": 50330,
  "∧": 50277,
  "∨": 50278,
  "∩": 50279,
  "∪": 50280,
  "≠": 50281,
  "≡": 50282,
  "≢": 50283,
  "≤": 50284,
  "≥": 50285,
  "⊂": 50286,
  "⊃": 50287,
  "⊆": 50288,
  "⊇": 50326,
  "⊖": 50289,
  "⊢": 50290,
  "⊣": 50291,
  "⊤": 50292,
  "⊥": 50293,
  "⋄": 50266,
  "⌈": 50294,
  "⌊": 50295,
  "⌶": 50296,
  "⌷": 50297,
  "⌸": 50299,
  "⌹": 50300,
  "⌺": 50301,
  "⌽": 50302,
  "⌿": 50303,
  "⍀": 50304,
  "⍉": 50305,
  "⍋": 50306,
  "⍎": 50307,
  "⍒": 50308,
  "⍕": 50309,
  "⍙": 50310,
  "⍛": 50327,
  "⍝": 50267,
  "⍟": 50311,
  "⍠": 50312,
  "⍢": 50328,
  "⍣": 50313,
  "⍤": 50314,
  "⍥": 50315,
  "⍨": 50316,
  "⍪": 50317,
  "⍫": 50329,
  "⍬": 50318,
  "⍱": 50319,
  "⍲": 50320,
  "⍳": 50321,
  "⍴": 50322,
  "⍵": 50269,
  "⍷": 50323,
  "⍸": 50324,
  "⍺": 50268,
  "⎕": 50298,
  "○": 50325
}
